
## Plan Result (cube-unit.net)

[CI link](https://github.com/shimosyan/cube-unit.net/actions/runs/16536847651)


<pre><code>Plan: 1 to add, 2 to change, 0 to destroy.</code></pre>

* Create
  * aws_cloudfront_function.url_rewrite
* Update
  * aws_cloudfront_distribution.s3_distribution
  * aws_s3_bucket_policy.policy


<details><summary>Change Result (Click me)</summary>

```hcl

  # data.aws_iam_policy_document.policy_document will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "policy_document" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::cube-unit.net",
              + "arn:aws:s3:::cube-unit.net/*",
            ]

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "arn:aws:cloudfront::158677943024:distribution/E34AL3HHOWXR5P",
                ]
              + variable = "aws:SourceArn"
            }

          + principals {
              + identifiers = [
                  + "cloudfront.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # aws_cloudfront_distribution.s3_distribution will be updated in-place
  ~ resource "aws_cloudfront_distribution" "s3_distribution" {
        id                              = "E34AL3HHOWXR5P"
        tags                            = {}
        # (24 unchanged attributes hidden)

      + custom_error_response {
          + error_code         = 403
          + response_code      = 404
          + response_page_path = "/404.html"
        }
      + custom_error_response {
          + error_code         = 404
          + response_code      = 404
          + response_page_path = "/404.html"
        }

      ~ default_cache_behavior {
            # (16 unchanged attributes hidden)

          + function_association {
              + event_type   = "viewer-request"
              + function_arn = (known after apply)
            }

            # (1 unchanged block hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # aws_cloudfront_function.url_rewrite will be created
  + resource "aws_cloudfront_function" "url_rewrite" {
      + arn             = (known after apply)
      + code            = <<-EOT
            function handler(event) {
                var request = event.request;
                var uri = request.uri;
            
                // ルートパスはそのまま（default_root_objectでindex.htmlが配信される）
                if (uri === '/') {
                    return request;
                }
            
                // 既に拡張子がある場合はそのまま
                if (uri.includes('.')) {
                    return request;
                }
            
                // 末尾にスラッシュがない場合、スラッシュとindex.htmlを追加
                // /about → /about/index.html
                if (!uri.endsWith('/')) {
                    request.uri = uri + '/index.html';
                }
                // 末尾がスラッシュの場合、index.htmlを追加
                // /about/ → /about/index.html
                else {
                    request.uri = uri + 'index.html';
                }
            
                return request;
            }
        EOT
      + comment         = "URL rewrite function for cube-unit.net Hugo static site"
      + etag            = (known after apply)
      + id              = (known after apply)
      + live_stage_etag = (known after apply)
      + name            = "cube-unit-net-url-rewrite"
      + publish         = true
      + runtime         = "cloudfront-js-1.0"
      + status          = (known after apply)
    }

  # aws_s3_bucket_policy.policy will be updated in-place
  ~ resource "aws_s3_bucket_policy" "policy" {
        id     = "cube-unit.net"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:GetObject"
                      - Condition = {
                          - StringEquals = {
                              - "aws:SourceArn" = "arn:aws:cloudfront::158677943024:distribution/E34AL3HHOWXR5P"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "cloudfront.amazonaws.com"
                        }
                      - Resource  = [
                          - "arn:aws:s3:::cube-unit.net/*",
                          - "arn:aws:s3:::cube-unit.net",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":15,"Program":"tfcmt","SHA1":"76c97931b7d147065e1d24ecb35a81a8b584dca9","Target":"cube-unit.net","Vars":{},"WorkflowName":"terraform-pull-request"} -->